package hw_5;

public class Main {


//    В плані домашнього: щоб не вигадувати всяке різне, просто візьміть приклад з лекції і пройдіться по ВСІХ операціях
//    стріма, бажано по декілька разів.
//    Придумайте щось з ускладнених завдань, працюючи з List<Person>, кожен з об'єктів якого має List<Book>, наприклад:
//
//       1. згенерувати мапу <Person, Integer>, де Integer - кількість сторінок усіх книжок, які має людина
//       2. згенерувати мапу <String, Book>, де String - ім'я людини, Book - книжка з найбільшою кількістю сторінок
//       3. згенерувати List<Book> відфільтрувавши тільких тих людей, хто старше 25 років і книжки які мають більше 500 сторінок
//
//    Чим більше таких завдань придумаєте, тим більше плюсиків вам у карму.


}
